Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: Those attending to inspection, repair, alteration, servicing, cleaning and maintenance of such equipment shall be specially appointed.
sv: De som sköter kontroll, reparation, ändring, service, rengöring och underhåll av en sådan anordning skall vara särskilt utsedda.

source: A worker not coming within the scope of the foregoing but using work equipment as referred to in Section 15 at a common workplace shall have corresponding documentation available at the workplace.
sv: Den arbetande som inte omfattas av första stycket men använder arbetsutrustning enligt 15 § på ett gemensamt arbetsställe skall ha motsvarande dokumentation tillgänglig på arbetsstället.

source: Maintenance and inspection‌
sv: Underhåll och kontroll

source: Any maintenance logbook for the work equipment shall be kept up to date.
sv: När det finns en underhållsjournal till arbetsutrustningen skall den hållas aktuell.

source: The same applies when the equipment has been moved and assembled in a new location.
sv: Detsamma gäller när utrustningen har flyttats och monterats på en ny plats.

source: An item of work equipment used outside the undertaking shall be accompanied by a certificate showing when the last inspection took place.
sv: När en arbetsutrustning används utanför företaget skall den åtföljas av ett bevis på när den senaste kontrollen utfördes.

source: Through these Provisions, the following Notices, Provisions and General Recommendations issued previously by the National Board of Occupational Safety and Health are repealed.
sv: Genom författningen upphävs följande av Arbetarskyddsstyrelsen utfärdade meddelanden, föreskrifter och allmänna råd.

source: Notice 1974:4 Storage Facilities for Bulk Goods.
sv: Medd 1974:4 Lagringsanordningar för massgods

source: Directions 19:7Scaffolding etc. – Shipyard Directions.
sv: Anv 19:7 Ställningar m m, Varvsanvisningar

source: Directions 128 Conveyors.
sv: Anv 128 Transportörer

source: AFS 1985:7 Lawn Mowers and Single-axled Garden Tractors.
sv: AFS 1985:7 Gräsklippare och enaxliga trädgårdstraktorer

source: AFS 1985:9 Work with Wheels and Tyres.
sv: AFS 1985:9 Arbete med hjul och däck

source: AFS 1987:18 Grinding Machines and Grinding Tools.
sv: AFS 1987:18 Slipmaskiner och slipverktyg

source: AFS 1991:6 Maintenance of Technical Devices.
sv: AFS 1991:6 Underhåll av teknisk anordning.

source: AFS 1998:4 Use of Work Equipment.
sv: AFS 1998:4 Användning av arbetsutrustning

source: Annex A‌
sv: Bilaga A‌‌

source: Technical stipulations
sv: Tekniska krav

source: The stipulations in this annex apply only when the use of the work equipment entails the risk referred to.
sv: Kraven i denna bilaga gäller endast när respektive risk finns när arbetsutrustningen används.

source: The measures required in order for work equipment to meet the stipulations in this annex are not necessarily the same as those needed to meet the basic requirements for work equipment coming under Section 7.
sv: För en arbetsutrustning som skall uppfylla kraven i denna bilaga krävs inte nödvändigtvis samma åtgärder som för att uppfylla de grundläggande kraven på en arbetsutrustning som omfattas av 7 §.

source: Work equipment shall have adequate mechanical strength and stability.
sv: En arbetsutrustning skall ha betryggande hållfasthet och stabilitet.

source: A 2.2 Musculoskeletal ergonomics
sv: A 2.2 Belastningsergonomi

source: Work equipment shall be conditioned so that the work can be done in suitable work postures and with suitable working movements.
sv: En arbetsutrustning skall vara beskaffad så att arbetet kan utföras i lämpliga arbetsställningar och med lämpliga arbetsrörelser.

source: A 2.3 Controls and control systems
sv: A 2.3 Manöveranordningar och styrsystem

source: Controls of work equipment shall, if capable of affecting safety, be clearly visible and identifiable and, where necessary, appropriately marked.
sv: Manöveranordningar på arbetsutrustning skall, om de kan påverka säkerheten, vara klart synliga och identifierbara och, där så är nödvändigt, vara märkta på ett ändamålsenligt sätt.

source: If possible the controls shall be positioned outside danger zones.
sv: Om det är möjligt skall manöveranordningarna vara placerade utanför riskområden.

source: They shall also be positioned in such a way that no risks will be entailed by the handling of them.
sv: De skall också vara placerade så att det inte medför några risker vid handhavandet.

source: They must not give rise to risks due to inadvertent operation.
sv: De får inte ge upphov till risker på grund av en oavsiktlig manöver.

source: If safety requires operations to be performed in a certain order, there shall be interlocking devices which prevent the operations being performed in the wrong order, or else it shall be otherwise ensured that the operations cannot be performed in the wrong order.
sv: Om säkerheten kräver att manövrer utförs i en viss ordning skall det finnas blockeringar (förreglingar) som hindrar att de utförs i fel ordning eller på annat sätt vara säkerställt att de inte går att utföra i fel ordning.

source: If necessary the operator shall be able to ascertain from the principal control point that no person is present in the risk zones.
sv: Om det behövs skall operatören från huvudmanöverplatsen kunna förvissa sig om att det inte finns någon inom riskområdena.

source: Failing this, there shall be a secure warning system which, before every start, will automatically emit an audible and/or visible warning signal.
sv: Om det inte går skall det finnas ett säkert varningssystem, som före varje start automatiskt avger en ljud- och/eller ljussignal.

source: A person wholly or partly present within the danger zone shall have the time and possibility to rapidly evade risks due to the work equipment starting or stopping.
sv: Den som helt eller delvis befinner sig inom riskområdet skall ha tid och möjlighet att snabbt undgå risker som beror på att arbetsutrustningen startar eller stoppar.

source: Control systems shall be safe and designed with regard to predictable faults, disturbances and stresses.
sv: Styrsystem skall vara säkra och utförda med tanke på de fel, störningar och påfrestningar som kan förutses.

source: If a unit in a work equipment can be started and stopped separately, control systems and safety devices shall be designed so that this can be done safely.
sv: Om en enhet i en arbetsutrustning kan startas och stoppas separat skall styrsystem och skyddsanordningar vara utförda så att detta kan ske under säkra förhållanden.

source: A 2.4 Choice of operating mode
sv: A 2.4 Val av styrsätt

source: If an item of work equipment can be operated both manually and mechanically, there shall be safety devices for both modes of operation.
sv: Om en arbetsutrustning kan betjänas såväl manuellt som maskinellt skall det finnas skyddsanordningar för båda arbetssätten.

source: When switching to manual operation, the relevant safety devices shall be automatically activated.
sv: Vid omställning till manuell betjäning skall relevanta skyddsanordningar aktiveras automatiskt.

source: Work equipment shall only be possible to start by means of a deliberate action and with a control intended for this purpose.
sv: En arbetsutrustning får bara gå att starta genom en medveten manöver och med ett manöverdon som är avsett för detta.

source: The same applies
sv: Detsamma gäller

source: in connection with restart, whatever the reason for the stop, when controlling a significant change in the work function (e.g. velocity., pressure etc.), except when a restart or change does not expose the worker to any risk.
sv: vid återstart, oavsett anledningen till stoppet, vid styrning av en betydande förändring av arbetsfunktionen (t.ex. hastighet, tryck etc.), utom då en återstart eller ändring inte utsätter den som arbetar för någon risk.

source: This stipulation does not apply if the restart or change of work function forms part of the normal work cycle of an item of automatic equipment.
sv: Kravet gäller inte om återstarten eller ändringen i arbetsfunktionen ingår i det normala arbetsförloppet i en automatisk utrustning.‌‌‌

source: A 2.6 Stop
sv: A 2.6 Stopp

source: All work equipment shall have a control with which it can be safely brought to a complete standstill.
sv: Alla arbetsutrustningar skall ha ett manöverdon som gör det möjligt att stoppa dem helt och under säkra förhållanden.

source: Every work station shall have a control with which all or parts of the work equipment can be stopped, depending on the type of risk, and thereby put in a safe state.
sv: Varje arbetsplats skall ha ett manöverdon som gör det möjligt att stoppa hela eller delar av arbetsutrustningen, beroende på typ av risk, så att den är i ett säkert tillstånd.

source: The stop controls shall have priority over the start controls.
sv: Stoppdonet skall ha prioritet över startanordningen.

source: When the work equipment or its hazardous parts have been brought to a standstill, the energy supply to the drive devices concerned shall normally be cut off.
sv: När arbetsutrustningen eller dess farliga delar har bringats till stopp skall energitillförseln till de aktuella drivanordningarna normalt brytas.

source: The stopping of work equipment or of a particular function in it must not entail risk of ill- health or accidents, nor may it cut off the energy supply to operating and driving devices if this could entail a risk or impede rescue operations in the event of an accident.
sv: Stopp av en arbetsutrustning eller någon särskild funktion i den får inte medföra risk för ohälsa eller olycksfall eller bryta energitillförseln till styr- och drivanordningar, om det kan medföra risk eller försvåra räddning vid olycka.

source: A 2.7 Emergency stop
sv: A 2.7 Nödstopp

source: Depending on the risks entailed by the use of work equipment and its normal stopping time, the equipment shall, where appropriate, have an emergency stopping device.
sv: Med hänsyn till riskerna vid användning av en arbetsutrustning och dess normala stopptid skall den, om det är befogat, ha en nödstoppsanordning.

source: The emergency stopping device shall swiftly curtail functions which can entail a risk of ill- health and accidents.
sv: Nödstoppsanordningen skall snabbt stoppa funktioner som kan innebära risk för ohälsa och olycksfall.

source: Restart after an emergency stop shall not be possible automatically or by resetting one or more emergency stop devices.
sv: Återstart efter nödstopp får inte kunna ske -automatiskt eller genom att ett eller flera nödstoppsdon återställs.

source: Restart may only be possible using a control device intended for the purpose.
sv: Återstart får endast kunna ske med ett manöverdon som är avsett för detta.

source: An emergency stop must not entail danger.
sv: Nödstopp får inte innebära fara.

source: Nor may it cut off the energy supply to equipment which has to work under emergency conditions.
sv: Det får inte heller bryta energitillförseln till utrustning som måste fungera under nödförhållanden.

source: After actuation an emergency stopping device shall remain in the actuated position.
sv: Nödstoppsdon skall efter påverkan stanna i påverkat läge.

source: Restart must not be possible until the device has been manually reset.
sv: Det får inte gå att återstarta förrän donet har återställts manuellt.

source: Emergency stopping devices shall be constructed, marked and positioned in such a way that they can be quickly located and reached by an operator or some other person.
sv: Nödstoppsdon skall vara utförda, märkta och placerade så att de lätt och snabbt kan lokaliseras och nås av en operatör eller någon annan.

source: A 2.8 Setting and programming
sv: A 2.8 Inställning och programmering

source: If an item of work equipment has to be set or programmed while in motion, this shall be feasible in safe conditions.
sv: Om en arbetsutrustning måste ställas in eller programmeras medan den är i gång skall det kunna utföras under säkra förhållanden.

source: If regular safety devices have to be suspended while the work is in progress, it must not be possible for the equipment to be put back into production before the safety devices have been activated again.
sv: Om ordinarie skyddsanordningar måste kopplas bort vid arbetet får utrustningen inte kunna återgå i produktion förrän skyddsanordningarna har kopplats in igen.

source: A 2.9 Falling and ejected objects
sv: A 2.9 Fallande föremål och utkast

source: Work equipment entailing a risk because of falling or flying objects shall have suitable safety devices adapted to the risks.
sv: En arbetsutrustning, som medför risk på grund av fallande föremål eller något som kastas ut, skall ha lämpliga skyddsanordningar anpassade efter riskerna.

source: A 2.10 Extraction device and enclosure
sv: A 2.10 Utsug och inneslutning

source: Work equipment entailing a risk due to falling or ejected objects shall have suitable safety devices adapted to the hazards.
sv: En arbetsutrustning, som medför risk på grund av utsläpp av gas, ånga eller vätska eller spridning av damm, skall ha lämplig inneslutning och/eller vara försedd med lämpliga utsugningsanordningar nära spridningskällorna.

source: A 2.11 Clamping and stabilising
sv: A 2.11 Fastspänning och stabilisering

source: Work equipment and parts of the same shall, when necessary for safety and health, be clamped or stabilised in some other way.
sv: En arbetsutrustning och delar i en sådan skall, när det behövs för säkerhet och hälsa, vara fastspända eller stabiliserade på annat sätt.

source: A 2.12 Material failure‌
sv: A 2.12 Materialbrott

source: Suitable safety measures shall be taken when there is a risk of work equipment disintegrating or of fractures occurring in parts of it and this can entail safety and health hazards.
sv: Lämpliga skyddsåtgärder skall vidtas när det finns risk för att en arbetsutrustning skall sprängas, eller för brott på dess delar, och det kan medföra risker för säkerhet och hälsa.

source: A 2.13 Safety and safety devices
sv: A 2.13 Skydd och skyddsanordningar‌‌

source: Work equipment shall have guards or safety devices if any accident risk is entailed by contact with moving or otherwise dangerous parts.
sv: En arbetsutrustning skall ha skydd eller skyddsanordningar om det finns någon olycksrisk vid kontakt med rörliga eller på annat sätt farliga delar.

source: These shall prevent access to the danger zones or stop dangerous functions before any person reaches the danger zones.
sv: De skall hindra tillträde till riskområdena eller stoppa farliga funktioner innan någon når riskområdena.

source: A protective guard which can be opened or removed easily without tools shall, failing special reason to the contrary, have interlocking devices so that
sv: Ett avskärmningsskydd som utan svårighet kan öppnas eller tas bort utan verktyg skall, om särskilda skäl inte talar däremot, ha förreglingar så att

source: a dangerous machine function is prevented from starting or continuing if the guard is not in the protective position, restart will not occur automatically as a result of the guard being closed.
sv: farlig maskinfunktion hindras från att starta eller fortsätta om skyddet inte är i skyddsläge, återstart inte sker automatiskt genom att skyddet stängs.

source: Guards and safety devices
sv: Skydd och skyddsanordningar

source: shall be stoutly constructed,
sv: skall vara av robust konstruktion,

source: may not entail new hazards,
sv: får inte medföra nya risker,

source: may not be easy to remove or put out of operation,
sv: får inte vara lätta att avlägsna eller sättas ur funktion,

source: shall be positioned at a sufficient distance from the danger zone,
sv: skall vara placerade på tillräckligt avstånd från riskområdet,

source: must not obstruct the view of the equipment’s operations more than is necessary, shall make possible necessary intervention for the fitting or replacement of parts and for maintenance work.
sv: får inte skymma uppsikten över utrustningens operationer mer än nödvändigt, skall möjliggöra nödvändiga ingrepp för att montera eller byta ut delar och för underhållsarbete.

source: In this connection access may only be possible to the zone where the intervention is to take place and, if possible, without the guard or the safety device needing to be removed.
sv: Därvid får tillträde endast vara möjligt till det område där ingreppet skall utföras, och om möjligt, utan att skyddet eller skyddsanordningen behöver avlägsnas.

source: A two-handed control device for operating a hazardous machine function shall be designed and arranged in such a way that the function
sv: En tvåhandsmanöveranordning för att manövrera en farlig funktion hos en maskin skall vara utförd och ordnad så att funktionen

source: cannot start up unless both operating devices are actuated,
sv: bara kan starta om båda manöverdonen påverkas,

source: stops or becomes harmless if either control device is released, cannot start up again until both devices have been released and then actuated again.
sv: stoppar eller blir ofarlig om något av donen släpps, inte kan starta igen förrän båda donen släppts och åter påverkas.

source: A 2.14 Adjustable guards
sv: A 2.14 Inställbara skydd

source: If, for technical reasons, a machine tool cannot be kept inaccessible when in use, there shall be guards which are designed and can be set in such a way as to reduce the accident risk.
sv: Om ett maskinverktyg av arbetstekniska skäl inte kan hållas oåtkomligt när det används, skall det finnas skydd som är utförda och kan ställas in så att olycksrisken motverkas.

source: A 2.15 Interlocking guard with start function
sv: A 2.15 Förreglande skydd med startfunktion

source: If equipment can be started by closing a guard, it must not be possible for any part of the body to be inside the guard when the latter is closed.
sv: Om det går att starta en arbetsutrustning genom att stänga ett skydd får det inte gå att ha någon kroppsdel innanför skyddet då det är stängt.

source: A 2.16 Non-mechanically actuated safety devices
sv: A 2.16 Beröringsfria skyddsanordningar

source: A non-mechanically actuated safety device shall be designed and arranged in such a way that
sv: En beröringsfri skyddsanordning skall vara utförd och ordnad så att

source: dangerous functions are stopped and prevented from starting when part of a human body actuates the safety field,
sv: farliga funktioner avbryts och hindras från att starta när en kroppsdel påverkar skyddsfältet,

source: the protective function remains in the event of a fault in the safety-related parts of the operating system and then prevents restart, the work equipment, once it has been stopped by the safety device, can only be restarted following manual actuation of a special resetting device.
sv: skyddsfunktionen kvarstår vid fel på en komponent i styrsystemets -säkerhetsrelaterade delar och då hindrar ny start, arbetsutrustningen sedan den stoppats med skyddsanordningen bara kan återstartas efter manuell påverkan av särskilt återställningsdon.

source: If an item of work equipment can be started by a non-mechanically actuated safety device ceasing to be actuated, it must not be possible to have any part of the human body inside the safety zone when the latter is unactuated.
sv: Om det går att starta en arbetsutrustning genom att en beröringsfri skyddsanordning upphör att påverkas får det inte gå att ha någon kroppsdel innanför skyddsfältet då det är opåverkat.

source: A 2.17 Pinch points
sv: A 2.17 Valsingrepp

source: Suitable safety measures shall be taken if there is a risk of accidents in connection with material having to be threaded or inserted between rollers.
sv: Vid risk för olycksfall i samband med att material skall trädas eller stickas in i ett valsingrepp skall lämpliga skyddsåtgärder vidtas.

source: A 2.18 Lighting
sv: A 2.18 Belysning

source: Lighting in zones and places for work with or maintenance of work equipment shall be well adapted to the task.
sv: Belysningen på områden och ställen för arbete med eller underhåll av en arbetsutrustning skall vara väl anpassad till arbetet.

source: A 2.19 High or low temperature
sv: A 2.19 Hög eller låg temperatur‌‌‌

source: Parts of work equipment with a very high or very low temperature shall if necessary be guarded to prevent anyone coming into contact with them or too close to them.
sv: Om det behövs skall delar av en arbetsutrustning med hög eller mycket låg temperatur vara skyddade så att ingen kan komma i beröring med eller för nära dem.

source: A 2.20 Warning systems
sv: A 2.20 Varningssystem

source: A warning system on work equipment shall be unambiguous and easy to notice and understand.
sv: Ett varningssystem på en arbetsutrustning skall vara entydigt och lätt att upptäcka och förstå.

source: A 2.21 Maintenance
sv: A 2.21 Underhåll

source: Maintenance shall in the first instance be possible when equipment is turned off.
sv: Underhållsarbeten skall i första hand kunna utföras när en arbetsutrustning är avstängd.

source: Failing this, it shall be possible for suitable safety measures to be taken or for the work to take place outside danger zones, so as to afford adequate safety.
sv: Om det inte är möjligt skall det gå att vidta lämpliga skyddsåtgärder eller förlägga arbetet utanför riskområden så att säkerheten blir betryggande.

source: A 2.22 Disconnection of energy supply
sv: A 2.22 Frånkoppling av energitillförsel

source: Every item of work equipment shall have easily identifiable and unambiguous devices for cutting off all energy supply.
sv: Varje arbetsutrustning skall ha lätt identifierbara och entydiga anordningar för att frånkoppla all energitillförsel.

source: The energy supply shall be disconnectable and connectable without risk.
sv: Energitillförseln skall gå att koppla från och till utan risk.

source: Equipment for disconnecting the energy supply shall, except where this is manifestly unnecessary, be lockable or otherwise securable against unauthorised reconnection.
sv: En frånkopplingsutrustning för energitillförsel skall, om det inte är uppen-bart obehövligt, kunna låsas eller på annat sätt säkras mot obehörig återinkoppling.

source: A 2.23 Marking, signage and warning devices
sv: A 2.23 Märkning, skyltar och varningsanordningar

source: Work equipment shall have the marking, the signage and the warning devices which safety requires.
sv: En arbetsutrustning skall ha den märkning, de skyltar och de varningsanordningar som krävs för säkerheten.

source: Signage text shall be in Swedish.
sv: Skylttexten skall vara på svenska.

source: A 2.24 Access routes and work zones
sv: A 2.24 Tillträdesvägar och arbetsområden

source: There shall be safe access routes to all zones where presence is required for production, adjustment or maintenance work.
sv: Det skall finnas säkra tillträdesvägar till alla områden där närvaro fordras för produktions-, justerings- eller underhållsarbete.

source: It shall also be possible to remain in these zones safely.
sv: Det skall även gå att uppe-hålla sig säkert inom dessa områden.

source: The parts of work equipment where personnel stand or move shall be designed in such a way that there will be no risk of slipping, tripping or falling off them.
sv: De delar av en arbetsutrustning där personer står eller förflyttar sig ska vara utförda så att de inte riskerar att halka, snubbla eller falla därifrån.
